void setup(){
size(800,800);
ellipseMode(CENTER);
background(255);
}

void draw(){
translate(mouseX, mouseY);  //마우스의 위치를 따라 이동

fill(75,75,255);
ellipse(150,150,200,200);  //머리

fill(255);
ellipse(150,174,185,148);  //입 주변
ellipse(125,100,45,60);  //왼쪽 눈
ellipse(175,100,45,60);  //오른쪽 눈

fill(0,0,0);
ellipse(135,105,10,10);  //왼쪽 눈동자
ellipse(165,105,10,10);  //오른쪽 눈동자

fill(255,0,0);
arc(150,175,100,100,0,PI);  //입
ellipse(150,135,25,25);

fill(0);
line(150,175,150,145);  //인중
line(80,130,120,140);  //수염1
line(80,150,120,150);  //수염2
line(80,170,120,160);  //수염3

line(220,130,180,140);  //수염4
line(220,150,180,150);  //수염5
line(220,170,180,160);  //수염6
}
